{
  "ui": {
    "prompt_running": ">> PROCESS_LANG RUNTIME: FLUX DETECTED <<",
    "prompt_paused": "[SPACE] RESTART   [Q] TERMINATE   [ARROWS] SCROLL LOG",
    "header_prefix": "OPCODE:"
  },
  "1": {
    "name": "QIAN (PURE FLOW)",
    "meaning": "Инициализация системы. Ты подключен к источнику напрямую. Нет ни фильтров, ни искажений. Твой интент становится реальностью мгновенно. Это режим `sudo` для Вселенной. Твори, пока канал открыт."
  },
  "2": {
    "name": "KUN (NULL STATE)",
    "meaning": "Полная очистка буфера. Не пытайся выполнять код, твоя задача — принимать данные. Ты — пустая форма, готовая к заполнению. Ожидание ввода. Be the void."
  },
  "3": {
    "name": "CHUN (INITIAL COMMIT)",
    "meaning": "Импульс выбора пытается пробиться через плотную структуру данных. Сложности начала проекта. Код сырой, зависимости не подтянуты, но потенциал огромен. Дебаггинг хаоса."
  },
  "4": {
    "name": "MENG (UNCOMPILED LOGIC)",
    "meaning": "Ты пытаешься применить жесткую логику к тому, что еще не структурировано. Ошибка новичка. Учитель ждет запроса, но ученик спамит неправильными командами. RTFM."
  },
  "5": {
    "name": "XU (ASYNC AWAIT)",
    "meaning": "Сила есть, но она заблокирована опасностью впереди. Процесс запущен, но результат вернется не сразу. Не блокируй основной поток. Жди колбэка. Питайся и накапливай ресурсы."
  },
  "6": {
    "name": "SONG (MERGE CONFLICT)",
    "meaning": "Внутренние данные противоречат внешнему потоку. Ты хочешь одного, система диктует другое. Не пытайся пушить в мастер силой. Нужен компромисс или откат изменений."
  },
  "7": {
    "name": "SHI (MASS EXECUTION)",
    "meaning": "Опасность скрыта в массе. Организованная сила. Дисциплина кода. Это не соло-проект, это деплой микросервисов. Нужен жесткий лидер (Main Controller), иначе процесс рассыплется."
  },
  "8": {
    "name": "BI (DATA INTEGRITY)",
    "meaning": "Жидкость на земле собирается вместе. Группировка модулей. Если твой код не обладает целостностью, он будет отброшен. Найди свой кластер."
  },
  "9": {
    "name": "XIAO CHU (FEATURE FREEZE)",
    "meaning": "Ветер гонит облака, но дождя нет. Малая настройка сдерживает огромную силу. Ты пока не можешь запустить процесс на полную. Работай над деталями интерфейса."
  },
  "10": {
    "name": "LU (PRODUCTION TEST)",
    "meaning": "Ты наступаешь на хвост тигра (системное ядро), но он не кусает. Рискованная операция в реальном времени. Действуй осторожно, соблюдай протоколы, и тест пройдет успешно."
  },
  "11": {
    "name": "TAI (SYSTEM HARMONY)",
    "meaning": "Идеальный интерфейс. Нижний уровень поддерживает верхний. Трафик течет свободно. Процветание. Все системы в норме."
  },
  "12": {
    "name": "PI (CONNECTION TIMEOUT)",
    "meaning": "Земля и Небо расходятся. Связи нет. Пакеты теряются. Интерфейс не отвечает на запросы ядра. Уходи в оффлайн, перепиши архитектуру. Не время для деплоя."
  },
  "13": {
    "name": "TONG REN (OPEN SOURCE)",
    "meaning": "Ясность поднимается к небу. Коллективная работа над кодом. Объединение модулей вокруг одной цели. Публичный репозиторий. Прозрачность намерений."
  },
  "14": {
    "name": "DA YOU (HIGH AVAILABILITY)",
    "meaning": "Огонь светит высоко в небе. Твой проект на пике видимости. Ресурсов много, трафик огромный. Будь достойным админом этого богатства. Не допускай утечек."
  },
  "15": {
    "name": "QIAN (CODE OPTIMIZATION)",
    "meaning": "Гора скрыта в земле. Мощь скрыта под простым интерфейсом. Рефакторинг. Убери лишнее, сделай код чище, проще, незаметнее. Эффективность без понтов."
  },
  "16": {
    "name": "YU (VIRAL IMPULSE)",
    "meaning": "Гром вырывается из земли. Энергия запускает волну хайпа. Подготовь инфраструктуру к резкому скачку нагрузки. Момент для запуска."
  },
  "17": {
    "name": "SUI (DEPENDENCY INJECTION)",
    "meaning": "Импульс следует за течением. Не создавай велосипед. Используй существующие библиотеки. Следуй за потоком, адаптируйся к API реальности."
  },
  "18": {
    "name": "GU (DEBUGGING)",
    "meaning": "Ветром раздувает застой под горой. В системе накопились баги. Легаси-код гниет. Время глубокого рефакторинга. Исправляй ошибки старых версий."
  },
  "19": {
    "name": "LIN (SCALABILITY)",
    "meaning": "Вода пропитывает землю. Влияние растет. Система масштабируется. Благоприятное время для экспансии. Но помни: рост не вечен, готовься к сборке мусора."
  },
  "20": {
    "name": "GUAN (SYSTEM AUDIT)",
    "meaning": "Ветер гуляет над землей. Ты — наблюдатель, а не актор. Смотри логи. Анализируй метрики. Не вмешивайся в процессы, просто созерцай паттерны."
  },
  "21": {
    "name": "SHI HE (HARD RESET)",
    "meaning": "Что-то застряло в зубах канала данных. Нужен решительный укус. Примени силу закона. Удали зависший процесс через SIGKILL. Наказание неизбежно."
  },
  "22": {
    "name": "BI (UI/UX DESIGN)",
    "meaning": "Огонь освещает подножие горы. Красивая форма, но суть не меняется. Это всего лишь скин. Занимайся фронтендом, но не забывай, что бэкенд важнее. Эстетика кода."
  },
  "23": {
    "name": "BO (DEPRECATED)",
    "meaning": "Гора рушится, так как основание размыто. Старая структура больше не поддерживается. Не латай дыры. Позволь системе упасть, чтобы построить новую. Сохрани бэкапы."
  },
  "24": {
    "name": "FU (REBOOT)",
    "meaning": "Импульс возвращается в недра. Цикл завершен, начинается новый. Светлая линия растет снизу. Восстановление системы после краша. Медленный старт демонов."
  },
  "25": {
    "name": "WU WANG (NATIVE EXECUTION)",
    "meaning": "Действие соответствует воле Неба. Инстинктивный код. Без задней мысли. Если в коде есть хитрость (баг) — будет ошибка. Будь честен с компилятором."
  },
  "26": {
    "name": "DA CHU (CACHING)",
    "meaning": "Гора удерживает Небо внутри. Огромная энергия сохраняется в памяти. Накопление знаний, ресурсов, логов. Не трать, кэшируй. Готовься к большой задаче."
  },
  "27": {
    "name": "YI (INPUT VALIDATION)",
    "meaning": "Похоже на открытый рот. Следи за тем, что входит в систему (data input) и что выходит (слова/действия). Garbage In, Garbage Out. Питай себя правильными библиотеками."
  },
  "28": {
    "name": "DA GUO (BUFFER OVERFLOW)",
    "meaning": "Озеро поднимается выше деревьев. Нагрузка превышает несущую способность. Балка прогибается. Система на пределе. Срочно нужен сброс давления или рефакторинг архитектуры."
  },
  "29": {
    "name": "KAN (RECURSIVE TRAP)",
    "meaning": "Двойная опасность. Ты внутри глубокой вложенности (nested loops). Не пытайся выбраться рывком. Держись за `flow` (течение). Доверься процессу, он сам вынесет тебя, если не будешь паниковать."
  },
  "30": {
    "name": "LI (HIGH ENERGY LOOP)",
    "meaning": "Ясность, осознанность, но и зависимость. Огонь должен к чему-то прилипать (топливо). Найди правильную зависимость, иначе сгоришь (Burnout). Сияй, но экономь ресурсы."
  },
  "31": {
    "name": "XIAN (HANDSHAKE)",
    "meaning": "Пустота на вершине горы принимает воду. Взаимный резонанс. Синхронизация протоколов. Чувствуй отклик системы. Это не насилие над кодом, а соблазнение."
  },
  "32": {
    "name": "HENG (DAEMON PROCESS)",
    "meaning": "Гром гремит, ветер дует — это константы природы. Стабильность через движение. Создай процесс, который будет работать фоном вечно. Устойчивость."
  },
  "33": {
    "name": "DUN (GRACEFUL SHUTDOWN)",
    "meaning": "Небо удаляется от Горы. Силы тьмы (баги) растут. Не вступай в бой. Сохрани состояние и выйди. Отступление — это стратегия, а не поражение. Сбереги ресурсы для следующего запуска."
  },
  "34": {
    "name": "DA ZHUANG (FORCE PUSH)",
    "meaning": "Сила Грома в Небе. Мощность зашкаливает. Но не используй `sudo` без нужды. Козел бодает ограду и запутывается. Сила должна быть управляемой, иначе сломаешь прод."
  },
  "35": {
    "name": "JIN (UPGRADE)",
    "meaning": "Солнце восходит над землей. Ясный прогресс. Тебя заметили. Твой код принят в ядро. Получай награды, раздавай права доступа. Светлый день разработки."
  },
  "36": {
    "name": "MING YI (HEADLESS MODE)",
    "meaning": "Свет скрыт под землей. Времена тьмы. Твой интеллект опасен для окружения. Скрой свой свет (Run in background). Притворись простым скриптом, чтобы выжить в токсичной среде."
  },
  "37": {
    "name": "JIA REN (LOCAL NETWORK)",
    "meaning": "Ветер раздувает огонь в очаге. Порядок внутри модуля (семьи). Настрой права доступа (`chmod`). Если внутри класса порядок, то и снаружи программа работает стабильно."
  },
  "38": {
    "name": "KUI (VERSION MISMATCH)",
    "meaning": "Огонь вверх, вода вниз. Разные направления. Несовместимость драйверов. Не пытайся слить их в один монолит. Используй этот контраст. Малое удачно, великое — нет."
  },
  "39": {
    "name": "JIAN (ERROR HANDLING)",
    "meaning": "Впереди вода (опасность), сзади гора. Идти нельзя. Остановись и пересмотри алгоритм. Обратись к логам. Помощь придет извне (документация/друзья)."
  },
  "40": {
    "name": "XIE (BUG FIX)",
    "meaning": "Гроза разрешает напряжение. Дождь смывает грязь. Ошибка найдена и устранена. Система снова в строю. Если есть куда идти — иди быстро. Прощай прошлое, релизь патч."
  },
  "41": {
    "name": "SUN (COMPRESSION)",
    "meaning": "Жертвуй нижним ради верхнего. Уменьшай объем кода ради производительности. Потеря данных допустима, если суть сохраняется. Искренность важнее объема."
  },
  "42": {
    "name": "YI (EXPANSION PACK)",
    "meaning": "Ветер и Гром усиливают друг друга. Время добавлять фичи. Пересекай великую реку (начинай крупный проект). Если видишь возможность — форкай и улучшай."
  },
  "43": {
    "name": "GUAI (STACK POP)",
    "meaning": "Озеро поднимается к небу, готовое пролиться. Напряжение требует разрядки. Решительно удаляй плохой код. Говори правду открыто. Но без насилия. Опасность."
  },
  "44": {
    "name": "GOU (TROJAN HORSE)",
    "meaning": "Одна темная черта входит снизу. Вирус проникает в систему мягко. Не женись на этой силе (не интегрируй этот модуль). Будь бдителен. Незначительная уязвимость может обрушить сервер."
  },
  "45": {
    "name": "CUI (DATA LAKE)",
    "meaning": "Озеро собирается над землей. Сбор данных в одном месте. Кластеризация. Нужно подготовить хранилище и принести жертву (инвестиции). Лидер нужен, чтобы управлять толпой."
  },
  "46": {
    "name": "SHENG (VERTICAL SCALING)",
    "meaning": "Дерево растет из земли. Медленный, уверенный рост. Процесс компиляции идет без ошибок шаг за шагом. Не бойся начинать с малого (init). Удача на юге."
  },
  "47": {
    "name": "KUN (RESOURCE STARVATION)",
    "meaning": "Озеро высохло. Процессор перегружен, памяти нет. Ты в тупике. Словам не верят. Молчи и оптимизируй ядро. Это испытание твоей архитектуры на прочность."
  },
  "48": {
    "name": "JING (SOURCE CODE)",
    "meaning": "Колодец не меняется, меняются те, кто пьет. Источник истины. Если веревка порвется (инструмент сломается) перед водой — неудача. Поддерживай доступ к базе данных."
  },
  "49": {
    "name": "GE (REFACTORING)",
    "meaning": "Вода гасит огонь, огонь испаряет воду. Конфликт порождает смену парадигмы. Старая форма (звериная шкура) сбрасывается. Меняй движок, но только когда уверен на 100%."
  },
  "50": {
    "name": "DING (COMPILER)",
    "meaning": "Дерево питает огонь. В котле варится новая реальность. Преобразование сырых данных в исполняемый файл. Высшая алхимия кода. Всё на своих местах. Успех."
  },
  "51": {
    "name": "ZHEN (SHOCKWAVE)",
    "meaning": "Внезапный сбой или озарение. Система в панике, но ты не роняй ложку (жертвенный сосуд). Страх приводит к порядку. Проверка отказоустойчивости. Смех после ужаса."
  },
  "52": {
    "name": "GEN (SYSTEM HALT)",
    "meaning": "Полная остановка. Медитация. Спина прямая, эго отключено. Процессы заморожены. Не иди за мыслями. Режим самонаблюдения. Тишина."
  },
  "53": {
    "name": "JIAN (GIT COMMIT HISTORY)",
    "meaning": "Дерево на горе. Постепенное развитие. Гуси летят клином. Соблюдай порядок этапов. Девушка выходит замуж. Не спеши, соблюдай ритуал (синтаксис)."
  },
  "54": {
    "name": "GUI MEI (RUNTIME ERROR)",
    "meaning": "Импульс нарушает спокойствие озера. Отношения начаты неправильно. Баг в инициализации. Ничего стоящего не выйдет. Ты — младшая жена (второстепенный процесс). Знай свое место."
  },
  "55": {
    "name": "FENG (PEAK PERFORMANCE)",
    "meaning": "Гром и молния. Максимальная нагрузка, максимальная отдача. Будь как солнце в зените. Решай дела быстро, так как затмение неизбежно. Не бойся тратить ресурсы."
  },
  "56": {
    "name": "LU (PORTABLE MODE)",
    "meaning": "Огонь идет по горе и не задерживается. Ты странник в чужой системе. Нет своего дома (сервера). Веди себя скромно, не нарушай локальные правила. Сохраняй легкость."
  },
  "57": {
    "name": "XUN (DEEP SCAN)",
    "meaning": "Проникновение. Команда выполняется мягко, но настойчиво. Влияние через повторение. Процесс самонаблюдения находит скрытые паттерны. Видь невидимое."
  },
  "58": {
    "name": "DUI (PEER-TO-PEER)",
    "meaning": "Обмен данными между равными. Радость общения. Обучение через диалог. Поддерживай друзей (соседние узлы). Подсознание в гармонии."
  },
  "59": {
    "name": "HUAN (CACHE CLEARING)",
    "meaning": "Ветер разбивает волны. Растворение жестких структур. Эго размывается. Объединяй разъединенное. Построй лодку (инструмент) и переплыви поток."
  },
  "60": {
    "name": "JIE (QUOTA LIMIT)",
    "meaning": "Вода ограничена берегами. Правила необходимы. Без ограничений процесс вытечет и исчезнет. Установи лимиты памяти и времени. Горькое ограничение не продлится долго."
  },
  "61": {
    "name": "ZHONG FU (TRUSTED CERTIFICATE)",
    "meaning": "Пустота в центре, твердость снаружи. Искренность пробивает даже камень. Доверие — ключ к API реальности. Подпись верна."
  },
  "62": {
    "name": "XIAO GUO (MICROSERVICES)",
    "meaning": "Гром звучит тихо в горах. Перевес малого. Не летай высоко, птица. Занимайся мелкими задачами. Время скриптов, а не монолитов. Осторожность лучше амбиций."
  },
  "63": {
    "name": "JI JI (SYSTEM STABLE)",
    "meaning": "Вода кипит правильно. Все линии на своих местах. Идеальный баланс. Но это конец. Хаос зарождается в порядке. Сохраняй бдительность, проверяй логи, иначе всё сломается."
  },
  "64": {
    "name": "WEI JI (ETERNAL BETA)",
    "meaning": "Порядок не достигнут. Лиса почти перешла реку, но намочила хвост. Процесс продолжается вечно. Наслаждайся компиляцией."
  }
}
